zephyrproject-rtos/zephyr/drivers/i2c/i2c_stm32_rtio.c
/*
 * Copyright (c) 2025 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/drivers/i2c/rtio.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/pm/policy.h>
#include <zephyr/rtio/rtio.h>
#include <zephyr/sys/util.h>

#include <soc.h>
#include <stm32_ll_i2c.h>
#include <stm32_ll_rcc.h>
#include <errno.h>

#include "i2c_stm32.h"
#include "i2c-priv.h"

LOG_MODULE_REGISTER(i2c_ll_stm32_rtio, CONFIG_I2C_LOG_LEVEL);

static bool i2c_stm32_start(const struct device *dev, int *status)
{
	struct i2c_stm32_data *data = dev->data;
	struct i2c_rtio *ctx = data->ctx;
	struct rtio_sqe *sqe = &ctx->txn_curr->sqe;
	struct i2c_dt_spec *dt_spec = sqe->iodev->data;
	uint8_t flags = sqe->iodev_flags;
	int error;

#ifdef CONFIG_I2C_STM32_V2
	struct rtio_iodev_sqe *iodev_sqe_next = rtio_txn_next(ctx->txn_curr);

	if ((iodev_sqe_next != NULL) &&
	    ((sqe->iodev_flags & I2C_MSG_STOP) == 0U) &&
	    ((iodev_sqe_next->sqe.iodev_flags & I2C_MSG_RESTART) == 0U)) {
		flags |= I2C_MSG_STM32_USE_RELOAD_MODE;
	}
#endif

	switch (sqe->op) {
	case RTIO_OP_RX:
		if (sqe->rx.buf_len == 0) {
			*status = 0;
			return false;
		}
		error = i2c_stm32_msg_start(dev, I2C_MSG_READ | flags, sqe->rx.buf, sqe->rx.buf_len,
					    dt_spec->addr);
		break;
	case RTIO_OP_TINY_TX:
		if (sqe->tiny_tx.buf_len == 0) {
			*status = 0;
			return false;
		}
		error = i2c_stm32_msg_start(dev, flags, sqe->tiny_tx.buf, sqe->tiny_tx.buf_len,
					    dt_spec->addr);
		break;
	case RTIO_OP_TX:
		if (sqe->tx.buf_len == 0) {
			*status = 0;
			return false;
		}
		error = i2c_stm32_msg_start(dev, flags, (uint8_t *)sqe->tx.buf, sqe->tx.buf_len,
					    dt_spec->addr);
		break;
	case RTIO_OP_I2C_CONFIGURE:
		*status = i2c_stm32_runtime_configure(dev, sqe->i2c_config);
		return false;
#if CONFIG_I2C_STM32_BUS_RECOVERY
	case RTIO_OP_I2C_RECOVER:
		error = k_work_submit(&data->recovery_work);
		if (error < 0) {
			break;
		}
		return true;
#endif
	default:
		LOG_ERR("Invalid op code %d for submission %p\n", sqe->op, (void *)sqe);
		*status = -EINVAL;
		return false;
	}

	/* Reaching this point, no asynchronous sequence is started only if an error was reported */
	if (error != 0) {
		*status = error;
		return false;
	}

	return true;
}

void i2c_stm32_rtio_complete(const struct device *dev, int status)
{
	struct i2c_stm32_data *data = dev->data;
	bool async_started = false;

	if (i2c_rtio_complete(data->ctx, status)) {
		async_started = i2c_rtio_run_sync_start_async(dev, data->ctx, i2c_stm32_start);
	}

	if (!async_started) {
		i2c_stm32_pm_put(dev);
	}
}

static int i2c_stm32_configure(const struct device *dev,
				uint32_t dev_config_raw)
{
	struct i2c_stm32_data *data = dev->data;
	struct i2c_rtio *const ctx = data->ctx;

	return i2c_rtio_configure(ctx, dev_config_raw);
}

static int i2c_stm32_transfer(const struct device *dev, struct i2c_msg *msgs,
			      uint8_t num_msgs, uint16_t addr)
{
	struct i2c_stm32_data *data = dev->data;
	struct i2c_rtio *const ctx = data->ctx;

	/* Always set I2C_MSG_RESTART flag on first message in order to send start condition */
	msgs[0].flags |= I2C_MSG_RESTART;

#ifdef CONFIG_I2C_STM32_V2
	/*
	 * If a message has no STOP flag and next has no RESTART flag, set private flag
	 * I2C_MSG_STM32_USE_RELOAD_MODE in message flag to force STM32 v2 driver to enable
	 * reload mode for the message so that there is no Stop or Start conditions emitted
	 * in between. This means that flags shall not be used by the generic I2C framework.
	 */
	if ((msgs[0].flags & I2C_MSG_STM32_USE_RELOAD_MODE) != 0U) {
		LOG_ERR("Unexpected bit mask 0x%02lx set in I2C message",
			I2C_MSG_STM32_USE_RELOAD_MODE);
		return -EINVAL;
	}
#endif

	for (size_t n = 1; n < num_msgs; n++) {
#ifdef CONFIG_I2C_STM32_V2
		if ((msgs[n].flags & I2C_MSG_STM32_USE_RELOAD_MODE) != 0U) {
			LOG_ERR("Unexpected bit mask 0x%02lx set in I2C message",
				I2C_MSG_STM32_USE_RELOAD_MODE);
			return -EINVAL;
		}
#endif

		if (((msgs[n].flags & I2C_MSG_RW_MASK) != (msgs[n - 1].flags & I2C_MSG_RW_MASK)) &&
		    ((msgs[n].flags & I2C_MSG_RESTART) == 0U)) {
			LOG_ERR("Missing restart flag between message of different directions");
			return -EINVAL;
		}

		if ((msgs[n - 1].flags & I2C_MSG_STOP) != 0U) {
			LOG_ERR("Stop condition is only allowed on last message");
			return -EINVAL;
		}
	}

	return i2c_rtio_transfer(ctx, msgs, num_msgs, addr);
}

int i2c_stm32_get_config(const struct device *dev, uint32_t *config)
{
	struct i2c_stm32_data *data = dev->data;

	*config = data->dev_config;

	return 0;
}

static void i2c_stm32_submit(const struct device *dev, struct rtio_iodev_sqe *iodev_sqe)
{
	struct i2c_stm32_data *data = dev->data;
	int ret;

	/* Always set I2C_MSG_RESTART flag on first message in order to send start condition */
	iodev_sqe->sqe.iodev_flags |= RTIO_IODEV_I2C_RESTART;

	if (i2c_rtio_submit(data->ctx, iodev_sqe)) {
		ret = i2c_stm32_pm_get(dev);
		if (ret < 0) {
			/* Flush pending requests since we failed to get the device */
			do {
			} while (i2c_rtio_complete(data->ctx, ret));
		} else {
			if (!i2c_rtio_run_sync_start_async(dev, data->ctx, i2c_stm32_start)) {
				i2c_stm32_pm_put(dev);
			}
		}
	}
}

#ifdef CONFIG_I2C_STM32_BUS_RECOVERY
static void i2c_stm32_rtio_recovery_work_fn(struct k_work *work)
{
	struct i2c_stm32_data *data = CONTAINER_OF(work, struct i2c_stm32_data, recovery_work);
	const struct device *dev = data->ctx->dt_spec.bus;

	i2c_stm32_rtio_complete(dev, i2c_stm32_recover_bus(dev));
}

static int i2c_stm32_rtio_recover_bus(const struct device *dev)
{
	struct i2c_stm32_data *data = dev->data;

	return i2c_rtio_recover(data->ctx);
}
#endif /* CONFIG_I2C_STM32_BUS_RECOVERY */

DEVICE_API(i2c, i2c_stm32_driver_api) = {
	.configure = i2c_stm32_configure,
	.transfer = i2c_stm32_transfer,
	.get_config = i2c_stm32_get_config,
	.iodev_submit = i2c_stm32_submit,
#if CONFIG_I2C_STM32_BUS_RECOVERY
	.recover_bus = i2c_stm32_rtio_recover_bus,
#endif /* CONFIG_I2C_STM32_BUS_RECOVERY */
#if defined(CONFIG_I2C_TARGET)
	.target_register = i2c_stm32_target_register,
	.target_unregister = i2c_stm32_target_unregister,
#endif
};

int i2c_stm32_init(const struct device *dev)
{
	const struct device *const clk = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	const struct i2c_stm32_config *cfg = dev->config;
	uint32_t bitrate_cfg;
	int ret;
	struct i2c_stm32_data *data = dev->data;

	cfg->irq_config_func(dev);

	i2c_rtio_init(data->ctx, dev);
#if CONFIG_I2C_STM32_BUS_RECOVERY
	k_work_init(&data->recovery_work, i2c_stm32_rtio_recovery_work_fn);
#endif /* CONFIG_I2C_STM32_BUS_RECOVERY */

	i2c_stm32_activate(dev);

	if (cfg->pclk_len > 1) {
		/* Enable I2C clock source */
		ret = clock_control_configure(clk,
					(clock_control_subsys_t) &cfg->pclken[1],
					NULL);
		if (ret < 0) {
			return -EIO;
		}
	}

#if defined(CONFIG_SOC_SERIES_STM32F1X)
	/*
	 * Force i2c reset for STM32F1 series.
	 * So that they can enter controller mode properly.
	 * Issue described in ES096 2.14.7
	 */
	I2C_TypeDef *i2c = cfg->i2c;

	LL_I2C_EnableReset(i2c);
	LL_I2C_DisableReset(i2c);
#endif

	bitrate_cfg = i2c_map_dt_bitrate(cfg->bitrate);

	ret = i2c_stm32_runtime_configure(dev, I2C_MODE_CONTROLLER | bitrate_cfg);
	if (ret < 0) {
		LOG_ERR("i2c: failure initializing");
		return ret;
	}

	ret = pm_device_runtime_enable(dev);
	if (ret < 0) {
		return ret;
	}

	return 0;
}
